#### GridSegmentDirection Enumeration

---

|  |
| --- |
| See Also |

Specify one of the four adjacent segments to a GridNode. See  DividedSurface  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum GridSegmentDirection ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration GridSegmentDirection ``` |

| Visual C++ |
| --- |
| ``` public enum class GridSegmentDirection ``` |

# Members

| Member name | Description |
| --- | --- |
| PositiveU |  |
| NegativeU |  |
| PositiveV |  |
| NegativeV |  |

# See Also

Autodesk.Revit.DB Namespace